<a href="https://colab.research.google.com/github/LaetitiaVerel/Odyssey-Quests/blob/master/Pandas%20Part%202.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mission 1

Display the following information for this dataset: http://bit.ly/movieusers
- The last 5 rows
- The first 5 rows
- The type of each column

Note : start coding something by typing `pd.read...` and explore the different options available in `pandas`...

In [ ]:
import pandas as pd

url = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user"
Data1 = pd.read_csv(url, sep = "\|" , header = None, index_col = 0)
print(Data1)

      1  2              3      4
0
1    24  M     technician  85711
2    53  F          other  94043
3    23  M         writer  32067
4    24  M     technician  43537
5    33  F          other  15213
..   .. ..            ...    ...
939  26  F        student  33319
940  32  M  administrator  02215
941  20  M        student  97229
942  48  F      librarian  78209
943  22  M        student  77841

[943 rows x 4 columns]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

In [ ]:
Data1.tail(5)

      1  2              3      4
0
939  26  F        student  33319
940  32  M  administrator  02215
941  20  M        student  97229
942  48  F      librarian  78209
943  22  M        student  77841

In [ ]:
Data1.head(5)

    1  2           3      4
0
1  24  M  technician  85711
2  53  F       other  94043
3  23  M      writer  32067
4  24  M  technician  43537
5  33  F       other  15213

In [ ]:
column_types = Data1.dtypes
print(column_types)

1     int64
2    object
3    object
4    object
dtype: object

# Mission 2

Display the first 10 rows in the following file: http://bit.ly/drinksbycountry

In [ ]:
import pandas as pd

url = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv"
Data2 = pd.read_csv(url, sep=",", nrows=11)

In [ ]:
Data2.head(10)

             country  ...      continent
0        Afghanistan  ...           Asia
1            Albania  ...         Europe
2            Algeria  ...         Africa
3            Andorra  ...         Europe
4             Angola  ...         Africa
5  Antigua & Barbuda  ...  North America
6          Argentina  ...  South America
7            Armenia  ...         Europe
8          Australia  ...        Oceania
9            Austria  ...         Europe

[10 rows x 6 columns]

Use the country column as the index for the dataframe.

In [ ]:
Data2.set_index('country')

                   beer_servings  ...      continent
country                           ...
Afghanistan                    0  ...           Asia
Albania                       89  ...         Europe
Algeria                       25  ...         Africa
Andorra                      245  ...         Europe
Angola                       217  ...         Africa
Antigua & Barbuda            102  ...  North America
Argentina                    193  ...  South America
Armenia                       21  ...         Europe
Australia                    261  ...        Oceania
Austria                      279  ...         Europe
Azerbaijan                    21  ...         Europe

[11 rows x 5 columns]

# Mission 3

Access the values of the row for **Zimbabwe** (use the index value)

In [ ]:
Data2 = pd.read_csv(url, sep=",", index_col = "country")
Zimbabwe_values = Data2.query('country == "Zimbabwe"')
print(Zimbabwe_values)

          beer_servings  ...  continent
country                  ...
Zimbabwe             64  ...     Africa

[1 rows x 5 columns]

# Mision 4

Display only the continent value for the country **Zimbabwe**.

In [ ]:
Zimbabwe_continent_value = Data2.query('country == "Zimbabwe"')
print(Zimbabwe_continent_value["continent"])

country
Zimbabwe    Africa
Name: continent, dtype: object

# Mission 5

Rename the columns of the dataset below http://bit.ly/uforeports, try using the following 2 different methods to achieve this:
- Editing directly when reading the file
- Edit after creating the dataframe

In [ ]:
import pandas as pd
import requests
import io
url = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv"
s = requests.get(url).content
f = pd.read_csv(io.StringIO(s.decode('utf-8')))

f.rename(columns = {'City':'Ville', 'Colors Reported':'Couleurs Rapportés', 'Shape Reported':'Forme Rapportée', 'State':'Etat', 'Time':'Date'})

                      Ville Couleurs Rapportés  ... Etat              Date
0                    Ithaca                NaN  ...   NY    6/1/1930 22:00
1               Willingboro                NaN  ...   NJ   6/30/1930 20:00
2                   Holyoke                NaN  ...   CO   2/15/1931 14:00
3                   Abilene                NaN  ...   KS    6/1/1931 13:00
4      New York Worlds Fair                NaN  ...   NY   4/18/1933 19:00
...                     ...                ...  ...  ...               ...
18236            Grant Park                NaN  ...   IL  12/31/2000 23:00
18237           Spirit Lake                NaN  ...   IA  12/31/2000 23:00
18238           Eagle River                NaN  ...   WI  12/31/2000 23:45
18239           Eagle River                RED  ...   WI  12/31/2000 23:45
18240                  Ybor                NaN  ...   FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [ ]:
import pandas as pd
import requests
import io
url = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv"
s = requests.get(url).content
f = pd.read_csv(io.StringIO(s.decode('utf-8')))

colnames = ['Ville', 'Couleurs Rapportés', 'Forme Rapportée', 'Etat', 'Date'] 
New_column = pd.read_csv(io.StringIO(s.decode('utf-8')), names=colnames, header=None)
print(New_column)

             Ville Couleurs Rapportés Forme Rapportée   Etat              Date
0             City    Colors Reported  Shape Reported  State              Time
1           Ithaca                NaN        TRIANGLE     NY    6/1/1930 22:00
2      Willingboro                NaN           OTHER     NJ   6/30/1930 20:00
3          Holyoke                NaN            OVAL     CO   2/15/1931 14:00
4          Abilene                NaN            DISK     KS    6/1/1931 13:00
...            ...                ...             ...    ...               ...
18237   Grant Park                NaN        TRIANGLE     IL  12/31/2000 23:00
18238  Spirit Lake                NaN            DISK     IA  12/31/2000 23:00
18239  Eagle River                NaN             NaN     WI  12/31/2000 23:45
18240  Eagle River                RED           LIGHT     WI  12/31/2000 23:45
18241         Ybor                NaN            OVAL     FL  12/31/2000 23:59

[18242 rows x 5 columns]

# Mission 6

Select the first 3 rows and all the columns of the dataframe using iloc

In [ ]:
f.iloc[0:3]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

# Mission 7

Achieve the same result as in mission 6 by using loc

In [ ]:
first = 0
last = 2
f.loc[first:last]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00